# TopRailType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RailingType..::..TopRailType Property
RailingType Class See Also
---
The type of the top rail in the railing system.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId TopRailType { get; set; }
```

Visual Basic
---
```text
Public Property TopRailType As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ TopRailType {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The topRailType is not a valid top rail type. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
RailingType Class
Autodesk.Revit.DB.Architecture Namespace